# DATA ANALYSIS USING PANDAS

## Contents
  
      1. Introduction to pandas
      2. Advantages of pandas
      3. Pandas series and indexing
      4. Data Frames
      5. Merging
      6. File I/O
      7. Grouping 
      8. Sorting 
      9. Statistical 
      10. Plotting

### Pandas

1. Pandas is an open-source python libraty providing efficeint easy-to-use data structures and analysis tools
2. Derived from "PANel DAta - an Econometrics from Multidimensional data"
3. It is an excellent tool for processing and analyzinf real world dara
4. There are twi naub data structures in Pandas - Series and Dataframes
    A. Series - One dimensional ndarray with axis labels(including time series)
    B. Dataframe - Two-dimensional, size-mutable, potentially hetrogeneous tabular data

### Advantages of Pandas

1. Less Intution : Many methods, such as joining, selecting and loading files, are used without much intuition and wihout taking away mucj of the powerful nature of pandas. 
2. High Level of abstraction : Pandas have a higher abstraction laevel than Numpy, which gives it a simpler interface for users to interact
3. Faster Processing : The internal representation of DataFrames allow faster processing for some operations. Of course, this always depends on the data and its structure. 
4. Easy DataFrame Design : DataFrames are designed for operations with and on large datasets

## Installation and importing Pandas

1. conda install pandas
2. pip install pandas
3. import pandas as pd

In [3]:
import pandas as pd

# Series

## The data will be in 1D and the output of this series will be row by row ( line by line)

In [4]:
# Creating the data using series

a = pd.Series([1,2,3,4,5,6,7])
a

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [5]:
# Creating data using numpy in series

import numpy as np
a = pd.Series(np.array([1,2,3,4,5,6,7]))
a

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [6]:
# Creating series using tuple

a = pd.Series((1,2,3,4,5,6,7))
a

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [7]:
# Creatinf series using dictionaries

d = {'a':1,'b':2,'c':3}
d

{'a': 1, 'b': 2, 'c': 3}

In [8]:
a = pd.Series(d)
a

a    1
b    2
c    3
dtype: int64

In [9]:
# Changing the default index to defined index:

a = pd.Series([1,2,3,4], index = [4,3,2,1])
a

4    1
3    2
2    3
1    4
dtype: int64

In [10]:
a = [1,2,3,4,5,6,7]
b = pd.Series(a, index = np.arange(len(a)))
b

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [11]:
# Checking the datatype of series elements:

b.dtype

dtype('int64')

# DataFrames

In [12]:
a = pd.DataFrame([1,2,3,4,5,6,7])
a

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7

In [13]:
## Creating multiple columns:

a = pd.DataFrame([['Kowshik407',10,20,30],["Aravind415",40,50,60],["Sridhar",70,80,90]])
a

            0   1   2   3
0  Kowshik407  10  20  30
1  Aravind415  40  50  60
2     Sridhar  70  80  90

In [14]:
a = pd.DataFrame([['Kowshik407',10,20,30],["Aravind415",40,50,60],["Sridhar",70,80,90]], 
                 columns = ["Name", "Python", "JavaScript", "Java"])
a

         Name  Python  JavaScript  Java
0  Kowshik407      10          20    30
1  Aravind415      40          50    60
2     Sridhar      70          80    90

In [15]:
# Creating a dataframe using dictionary

d = {"Name" : ["Kowshik407", "Jassu434", "Triyekhson436"],
     "Branch" : ["ECE",'CSE','MECH'],
    "Year" : [2016,2017,2018]}
d

{'Name': ['Kowshik407', 'Jassu434', 'Triyekhson436'],
 'Branch': ['ECE', 'CSE', 'MECH'],
 'Year': [2016, 2017, 2018]}

In [16]:
a = pd.DataFrame(d, index = [1,2,3])
a

            Name Branch  Year
1     Kowshik407    ECE  2016
2       Jassu434    CSE  2017
3  Triyekhson436   MECH  2018

In [17]:
# Creating DataFrame using multiple dictionaries

data = [{'1':1,'2':2,'3':3},{'1':4,'3':7}]
data

[{'1': 1, '2': 2, '3': 3}, {'1': 4, '3': 7}]

In [18]:
a = pd.DataFrame(data)
a

   1    2  3
0  1  2.0  3
1  4  NaN  7

In [19]:
# converting series into dataframe 

d = {'one': pd.Series([1,2,3],index=[3,2,1]),
     'two': pd.Series([4,5,6],index=[6,5,4])}
d

{'one': 3    1
 2    2
 1    3
 dtype: int64,
 'two': 6    4
 5    5
 4    6
 dtype: int64}

In [20]:
a = pd.DataFrame(d)
a

   one  two
1  3.0  NaN
2  2.0  NaN
3  1.0  NaN
4  NaN  6.0
5  NaN  5.0
6  NaN  4.0

In [21]:
d = {'one': pd.Series([1,2,3],index=[3,2,1]),
     'two': pd.Series([4,5,6],index=[1,2,3])}
a = pd.DataFrame(d)
a

   one  two
1    3    4
2    2    5
3    1    6

In [22]:
a = [1,2,3,4]
a = pd.DataFrame(a,dtype = "Float64")
a

     0
0  1.0
1  2.0
2  3.0
3  4.0

In [23]:
a = pd.DataFrame([['Kowshik407',10,20,30],["Aravind415",40,50,60],["Sridhar",70,80,90]], 
                 columns = ["Name", "Python", "JavaScript", "Java"])
a

         Name  Python  JavaScript  Java
0  Kowshik407      10          20    30
1  Aravind415      40          50    60
2     Sridhar      70          80    90

# Accessing the Data

In [24]:
a.values

array([['Kowshik407', 10, 20, 30],
       ['Aravind415', 40, 50, 60],
       ['Sridhar', 70, 80, 90]], dtype=object)

In [25]:
a.index

RangeIndex(start=0, stop=3, step=1)

In [26]:
a = pd.DataFrame([[1,2,3,4,None,6],[5,6,7,None,None,8]],columns=['First Language','Second Language','Third Language','Science','Maths','Social'],index=['Rollno7','Rollno15'])
a

,First Language,Second Language,Third Language,Science,Maths,Social
Rollno7,1,2,3,4.0,None,6
Rollno15,5,6,7,NaN,None,8

In [27]:
a.isnull()

,First Language,Second Language,Third Language,Science,Maths,Social
Rollno7,False,False,False,False,True,False
Rollno15,False,False,False,True,True,False

In [28]:
a.notnull()

,First Language,Second Language,Third Language,Science,Maths,Social
Rollno7,True,True,True,True,False,True
Rollno15,True,True,True,False,False,True

In [29]:
a

,First Language,Second Language,Third Language,Science,Maths,Social
Rollno7,1,2,3,4.0,None,6
Rollno15,5,6,7,NaN,None,8

In [30]:
a = pd.DataFrame([['Kowshik407',10,20,30],["Aravind415",40,50,60],["Sridhar",70,80,90]], 
                 columns = ["Name", "Python", "JavaScript", "Java"])
a

         Name  Python  JavaScript  Java
0  Kowshik407      10          20    30
1  Aravind415      40          50    60
2     Sridhar      70          80    90

In [31]:
a["Name"]

0    Kowshik407
1    Aravind415
2       Sridhar
Name: Name, dtype: object

In [32]:
a["Name"][1]

'Aravind415'

In [33]:
a[:2]

         Name  Python  JavaScript  Java
0  Kowshik407      10          20    30
1  Aravind415      40          50    60

In [34]:
a[-1:]

      Name  Python  JavaScript  Java
2  Sridhar      70          80    90

In [35]:
a[-1:0]

Empty DataFrame
Columns: [Name, Python, JavaScript, Java]
Index: []

In [36]:
a.head()

         Name  Python  JavaScript  Java
0  Kowshik407      10          20    30
1  Aravind415      40          50    60
2     Sridhar      70          80    90

In [37]:
a.tail()

         Name  Python  JavaScript  Java
0  Kowshik407      10          20    30
1  Aravind415      40          50    60
2     Sridhar      70          80    90

In [38]:
a.head(2)

         Name  Python  JavaScript  Java
0  Kowshik407      10          20    30
1  Aravind415      40          50    60

In [39]:
a.tail(1)

      Name  Python  JavaScript  Java
2  Sridhar      70          80    90

# iloc and loc

* iloc : for accessing the rows using the index datatype integer.
* loc  : for accessing the rows using the defined index datatype.

In [40]:
a

         Name  Python  JavaScript  Java
0  Kowshik407      10          20    30
1  Aravind415      40          50    60
2     Sridhar      70          80    90

In [60]:
a.iloc[2] # default index accessing

Name          Sridhar
Python             70
JavaScript         80
Java               90
Name: 2, dtype: object

In [43]:
a.loc[2] # userdefined index accessing

Name          Sridhar
Python             70
JavaScript         80
Java               90
Name: 2, dtype: object